{
    "experiences": [
        {
            "title": "Junior Software Engineer",
            "link": "https://www.zivver.com/",
            "company": "Zivver",
            "type": "Full-time",
            "startDate": "Sept 2024",
            "endDate": "Present",
            "description": [
                "CloudSync Design & Implementation: Architected and developed a Python-based synchronization solution—CloudSync—that automates account and permission management from Exchange Online into Zivver using the SCIM protocol. By integrating with Azure Automate, CloudSync requires no manual version management or dedicated servers.", 
                "Scalable & Secure User Management: Enabled a secure, scalable, and cost-effective approach to user identity synchronization for Zivver clients up to 10,000 users, ensuring smooth onboarding, maintenance, and compliance through fully automated processes.",
                "Backend Bug Fixing & Familiarity: Continued refining backend services by identifying and resolving defects, improving test coverage by 5%, and enhancing overall platform stability and reliability.",
                "Team Collaboration & Mentorship: Onboarded and guided 3 interns, working closely with senior engineers to promote cross-skill development into frontend, knowledge sharing, and a culture of continuous learning within the team."
            ]
        },
        {
            "title": "Software Engineer Intern",
            "link": "https://www.zivver.com/",
            "company": "Zivver",
            "type": "Internship",
            "startDate": "Mar 2024",
            "endDate": "Sept 2024",
            "totalTime": "7 months",
            "description": [
                "Expanded Scala E2E Tests: Enhanced and extended end-to-end test coverage for critical business rule functionality, ensuring higher reliability and maintaining strong quality standards in the Scala-based codebase.",
                "Microservices Bug Fixing: Identified, analyzed, and resolved various issues within various Python-based microservices, improving system stability, performance, and overall user experience.",
                "Scala Back-End Enhancements: Implemented new audit logging features in the Scala back-end services, contributing to better traceability, security, and  compliance efforts withing the Zivver customer base.",
                "Deployment Procedure Improvements: Optimized and refined the Ansible-based deployment setup (the Polaris repository), streamlining release workflows, reducing operational friction, and enhancing deployment consistency across environments.",
                "Collaborated with software engineers and QA engineers to develop and test application procedures for system efficiency."
            ] 
        },
        {
            "title": "Software Engineer Intern",
            "link": "https://www.dvbcontrol.com/",
            "company": "DVBControl",
            "type": "Internship",
            "startDate": "Aug 2023",
            "endDate": "Oct 2023",
            "totalTime": "3 months",
            "description": [
                "Collaborated with the development team to create a web portal for DVB Control's broadcasting monitoring tool.",
                "Utilized the Angular framework to design and implement user-friendly web applications.",
                "Assisted in the analysis of databases to enhance data storage and retrieval efficiency.",
                "Assisted in implementing security measures to safeguard sensitive data and protect against potential vulnerabilities"
            ]
        },
        {
            "title": "Service Associate",
            "link": "https://sugo.nl/",
            "company": "SUGO Pizza al Taglio",
            "type": "Part-time",
            "startDate": "Jan 2023",
            "endDate": "Sept 2024",
            "totalTime": "1 year 9 months",
            "description": [
                "Expertly prepared and cooked a wide range of Italian-style pizzas to perfection, ensuring consistency in taste and presentation.",
                "Maintained a clean and organized kitchen, adhering to food safety and hygiene standards. Demonstrated proficiency in working with pizza ovens and other kitchen equipment.",
                "Coordinated and supervised fellow staff members during shifts, ensuring smooth restaurant operations.",
                "Fostered a collaborative and positive work environment, promoting teamwork and staff morale."
            ]
        }
    ]
}