{
    "experiences": [
        {
            "title": "Software Engineer Intern",
            "link": "https://www.zivver.com/",
            "company": "Zivver",
            "type": "Internship",
            "startDate": "Mar 2024",
            "endDate": "Present",
            "description": [
                "Led the performance optimization of key software systems, focusing on enhancing both frontend and backend functionalities to boost overall efficiency.",
                "Directed the design and implementation of user interface improvements, significantly elevating user experience across software platforms.",
                "Engineered and implemented scripts and tools for real-time performance evaluation of critical operational rules in production environments.",
                "Developed an internal analytical tool to monitor and analyze trigger events based on input data, enhancing strategic operational insights.",
                "Collaborated with cross-functional team members to ensure seamless integration of performance improvements into existing systems."
            ] 
        },
        {
            "title": "Service Associate",
            "link": "https://sugo.nl/",
            "company": "SUGO Pizza al Taglio",
            "type": "Part-time",
            "startDate": "Jan 2023",
            "endDate": "Present",
            "description": [
                "Expertly prepared and cooked a wide range of Italian-style pizzas to perfection, ensuring consistency in taste and presentation.",
                "Maintained a clean and organized kitchen, adhering to food safety and hygiene standards. Demonstrated proficiency in working with pizza ovens and other kitchen equipment.",
                "Coordinated and supervised fellow staff members during shifts, ensuring smooth restaurant operations.",
                "Fostered a collaborative and positive work environment, promoting teamwork and staff morale."
            ]
        },
        {
            "title": "Software Engineer Intern",
            "link": "https://www.dvbcontrol.com/",
            "company": "DVBControl",
            "type": "Internship",
            "startDate": "Aug 2023",
            "endDate": "Oct 2023",
            "totalTime": "3 months",
            "description": [
                "Collaborated with the development team to create a web portal for DVB Control's broadcasting monitoring tool.",
                "Utilized the Angular framework to design and implement user-friendly web applications.",
                "Assisted in the analysis of databases to enhance data storage and retrieval efficiency.",
                "Assisted in implementing security measures to safeguard sensitive data and protect against potential vulnerabilities"
            ]
        },
        {
            "title": "Customer Service Assistant",
            "link": "https://jackastors.com/",
            "company": "Jack Astor's Bar and Grill",
            "type": "Part-time",
            "startDate": "Feb 2022",
            "endDate": "Sep 2022",
            "totalTime": "7 months",
            "description": [
                "Skilled in delivering outstanding service by greeting and serving customers.",
                "Strong customer service attitude, self-reliant, dependable, able to prioritize, and multitask.",
                "Experience working as a leader and able to work well with others to accomplish a goal.",
                "Experienced with handling of high volume of customers."
            ]
        }
    ]
}